sales_admin/app/views/reports/index.html.erb

SELECT COUNT(*) FROM "items" WHERE "items"."report_id" = ?  [["report_id", 1]]
---
        <td><%= report.created_at %></td>
        <td><%= report.items.count %></td>