sales_admin/app/views/reports/show.html.erb

SELECT COUNT(*) FROM "items" WHERE "items"."report_id" = ?  [["report_id", 3]]
---
    <td><%= number_to_currency(@report.total_revenue)%></td>
    <td><%= @report.items.count %></td>