sales_admin/app/controllers/reports_controller.rb

SELECT  "reports".* FROM "reports" WHERE "reports"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @report = Report.find(params[:id])

INSERT INTO "reports" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-03-26 19:55:25.547494"], ["updated_at", "2019-03-26 19:55:25.547494"]]
INSERT INTO "items" ("description", "price", "customer_name", "merchant_name", "merchant_address", "created_at", "updated_at", "report_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    report = Report.create

    CSV.foreach(params[:csv_batch_file].tempfile, headers: false) do |row|
      row[3].to_i.times do
        report.items << Item.create(customer_name: row[0], description: row[1], price: row[2], merchant_name: row[4], merchant_address: row[5])